--[[
	事件定义
]]

--事件类型(事件在相应频道广播)
gEventTypeDef =
{
	Player = "uid@%d",		--玩家事件频道(玩家个人订阅)
	Alliance = "aid@%d",	--联盟事件频道(联盟内玩家订阅)
	Server = "svr@%d",		--服务器(王国)事件频道(王国内玩家订阅)
}

--事件
gEventDef =
{
	-------------------------------玩家事件----------------------------------begin-->
	Event_UidLogin = 100001, --玩家登录
	-------------------------------玩家事件----------------------------------end--<


	-------------------------------联盟事件----------------------------------begin-->
	Event_AidInfo = 200001, --联盟信息变更
	-------------------------------联盟事件----------------------------------end--<


	-------------------------------王国事件----------------------------------begin-->
	Event_CloseSvr = 300001, --关服
	-------------------------------王国事件----------------------------------end--<
}


--事件to事件类型
gEvent2Channel =
{
	-------------------------------玩家事件----------------------------------begin-->
	[gEventDef.Event_UidLogin] = gEventTypeDef.Player,
	-------------------------------玩家事件----------------------------------end--<


	-------------------------------联盟事件----------------------------------begin-->
	[gEventDef.Event_AidInfo] = gEventTypeDef.Alliance,
	-------------------------------联盟事件----------------------------------end--<


	-------------------------------王国事件----------------------------------begin-->
	[gEventDef.Event_CloseSvr] = gEventTypeDef.Server,
	-------------------------------王国事件----------------------------------end--<
}


--事件频道映射校验
for k,v in pairs(gEventDef) do
	assert(gEvent2Channel[v], string.format("gEvent2Channel invalid %s %s", k, v))
end

return gEventDef